package kt3days.day01

/**
 * 集合类型 Collection
 *
 * 同类型的值的组合, 根据整体特性分:
 * 1.有序可重复 - Array, 索引从0开始(index, i)
 * 2.无序不重复 - Set
 * 3.无序可重复 - Map, 但值有唯一的键(Key)
 */
fun main(args: Array<String>) {
    //-----------------------------------------------------------------
    //Array:  Array<类型> 或 arrayOf(元素1,元素2,...,元素n)
    //★大小固定,元素类型不可变
    //地铁11号线: "嘉定北","徐家汇","南翔","桃浦新村","上海西站", "罗山路","迪士尼"


    //创建一个有默认值的数组,Array(计数, {默认值})


    //创建1到10数组: Array(10, {i -> i + 1})
    //i代表元素的索引值,从0开始.


    //元素计数:count(),空否:isEmpty()


    //获取其中元素: 数组名[索引] , 首元素:数组名.first, 尾元素: 数组名.last
    //获取前5个元素的快捷方法 .component1到5


    //获取筛选重复元素后的数组: .distinct() 或用.toSet()转换为Set.


    //切割数组: sliceArray


    println("------------------------")

    //-----------------------------------------------------------------
    //mutableList:  MutableList<类型>或mutableListOf(元素1, 元素2, ...,元素n)
    //★大小可变,类型不可变.


    //在末尾增加元素:add方法. 添加另一个数组addAll方法


    //移出元素remove, 移出指定位置removeAt

}